nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.c
    psConfig->enableDebugMode = false;
    psConfig->enableWaitMode  = false;
    psConfig->enableRun       = false;
    psConfig->eValCompareMode = kPWM_CompareOnEqual;

    psConfig->sCounterConfig.eCountClockSource    = kPWM_ClockSrcBusClock;
    psConfig->sCounterConfig.eCountClockPrescaler = kPWM_ClockPrescaleDivide1;
    psConfig->sCounterConfig.eCountInitSource     = kPWM_InitOnLocalSync;
    psConfig->sCounterConfig.bEnableForceInitial  = false;
    psConfig->sCounterConfig.u16PhaseDelayValue   = 0x0U;

    psConfig->sReloadConfig.eReloadSignalSelect              = kPWM_LocalReloadSignal;
    psConfig->sReloadConfig.eLoclReloadEffectTime            = kPWM_TakeEffectAtReloadOportunity;
    psConfig->sReloadConfig.eLocalReloadOportunity           = kPWM_LoadEveryOportunity;
    psConfig->sReloadConfig.bEnableFullCycleReloadOportunity = true;
    psConfig->sReloadConfig.bEnableHalfCycleReloadOportunity = false;
    psConfig->sValRegisterConfig.u16CounterInitialValue      = 0xFF00U;
    psConfig->sValRegisterConfig.u16ValRegister0             = 0x0U;
    psConfig->sValRegisterConfig.u16ValRegister1             = 0x00FFU;
    psConfig->sValRegisterConfig.u16ValRegister2             = 0xFF80U;
    psConfig->sValRegisterConfig.u16ValRegister3             = 0x80U;
    psConfig->sValRegisterConfig.u16ValRegister4             = 0xFF80U;
    psConfig->sValRegisterConfig.u16ValRegister5             = 0x80U;

    psConfig->sForceConfig.bitPWM23OutputInitialVaule = 0U;
    psConfig->sForceConfig.bitPWM45OutputInitialVaule = 0U;
    psConfig->sForceConfig.bitPWMXOutputInitialVaule  = 0U;
    psConfig->sForceConfig.eForceSignalSelect         = kPWM_LocalSoftwareForce;
    psConfig->sForceConfig.eSoftOutputFor23           = kPWM_SoftwareOutputLow;
    psConfig->sForceConfig.eSoftOutputFor45           = kPWM_SoftwareOutputLow;
    psConfig->sForceConfig.eForceOutput23             = kPWM_GeneratedPwm;
    psConfig->sForceConfig.eForceOutput45             = kPWM_GeneratedPwm;

    psConfig->sDeadTimeConfig.eMode                             = kPWM_Independent;
    psConfig->sDeadTimeConfig.sDeadTimeValue0.bitsIntegerCycles = 0x0U;
    psConfig->sDeadTimeConfig.sDeadTimeValue1.bitsIntegerCycles = 0x0U;

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
    psConfig->sDeadTimeConfig.sDeadTimeValue0.bitsFractionalCycles = 0x0U;
    psConfig->sDeadTimeConfig.sDeadTimeValue1.bitsFractionalCycles = 0x0U;
    psConfig->sFracDelayConfig.bitsFracValue1                      = 0x0U;
    psConfig->sFracDelayConfig.bitsFracValue2                      = 0x0U;
    psConfig->sFracDelayConfig.bitsFracValue3                      = 0x0U;
    psConfig->sFracDelayConfig.bitsFracValue4                      = 0x0U;
    psConfig->sFracDelayConfig.bitsFracValue5                      = 0x0U;
    psConfig->sFracDelayConfig.bEnableVal1FractionalDelay          = false;
    psConfig->sFracDelayConfig.bEnableVal23FractionalDelay         = false;
    psConfig->sFracDelayConfig.bEnableVal45FractionalDelay         = false;
#endif

    psConfig->sOutputConfig.bVal0TriggerEnable       = false;
    psConfig->sOutputConfig.bVal1TriggerEnable       = false;
    psConfig->sOutputConfig.bVal2TriggerEnable       = false;
    psConfig->sOutputConfig.bVal3TriggerEnable       = false;
    psConfig->sOutputConfig.bVal4TriggerEnable       = false;
    psConfig->sOutputConfig.bVal5TriggerEnable       = false;
    psConfig->sOutputConfig.bEnableTriggerPostScaler = false;
#if (defined(FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL) && FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL)
    psConfig->sOutputConfig.eMuxTrigger0 = kPWM_ActualCompareEvent;
    psConfig->sOutputConfig.eMuxTrigger1 = kPWM_ActualCompareEvent;
#endif
    psConfig->sOutputConfig.ePwmXSignalSelect = kPWM_RawPwmX;
    psConfig->sOutputConfig.bInvertPwmxOutput = false;
    psConfig->sOutputConfig.bInvertPwmaOutput = false;
    psConfig->sOutputConfig.bInvertPwmbOutput = false;
    psConfig->sOutputConfig.bMaskPwmxOutput   = false;
    psConfig->sOutputConfig.bMaskPwmaOutput   = false;
    psConfig->sOutputConfig.bMaskPwmbOutput   = false;
    psConfig->sOutputConfig.bEnablePwmxOutput = true;
    psConfig->sOutputConfig.bEnablePwmaOutput = true;
    psConfig->sOutputConfig.bEnablePwmbOutput = true;
    psConfig->sOutputConfig.ePwmxFaultState   = kPWM_OutputLowOnFault;
    psConfig->sOutputConfig.ePwmaFaultState   = kPWM_OutputLowOnFault;
    psConfig->sOutputConfig.ePwmbFaultState   = kPWM_OutputLowOnFault;

    for (uint32_t i = 0; i < 3U; i++)
    {
        psConfig->sInCaptureConfig[i].eInCaptureSource          = kPWM_RawInput;
        psConfig->sInCaptureConfig[i].eCircuit0CaptureEdge      = kPWM_Noedge;
        psConfig->sInCaptureConfig[i].eCircuit1CaptureEdge      = kPWM_Noedge;
        psConfig->sInCaptureConfig[i].bEnableOneShotCapture     = false;
        psConfig->sInCaptureConfig[i].bitsCaptureFifoWatermark  = 0x0U;
        psConfig->sInCaptureConfig[i].u8EdgeCounterCompareValue = 0x0U;
    }

    psConfig->sPwmXFaultInputMapping.bFaultInput0Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput1Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput2Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput3Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput4Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput5Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput6Mapping = false;
    psConfig->sPwmXFaultInputMapping.bFaultInput7Mapping = false;

    psConfig->sPwmAFaultInputMapping.bFaultInput0Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput1Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput2Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput3Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput4Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput5Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput6Mapping = false;
    psConfig->sPwmAFaultInputMapping.bFaultInput7Mapping = false;

    psConfig->sPwmBFaultInputMapping.bFaultInput0Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput1Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput2Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput3Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput4Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput5Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput6Mapping = false;
    psConfig->sPwmBFaultInputMapping.bFaultInput7Mapping = false;

