nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.c
    psConfig->sDMAConfig.bEnableWriteValDMA            = false;
    psConfig->sDMAConfig.bEnableReadCaptureX0DMA       = false;
    psConfig->sDMAConfig.bEnableReadCaptureX1DMA       = false;
    psConfig->sDMAConfig.bEnableReadCaptureA0DMA       = false;
    psConfig->sDMAConfig.bEnableReadCaptureA1DMA       = false;
    psConfig->sDMAConfig.bEnableReadCaptureB0DMA       = false;
    psConfig->sDMAConfig.bEnableReadCaptureB1DMA       = false;
    psConfig->sDMAConfig.sCaptureDma.bEnableCaptureDMA = false;
    psConfig->sDMAConfig.sCaptureDma.eCaptureDMASource = kPWM_FIFOWatermarksORDma;

    psConfig->u16EnableInterruptMask = 0x0U;
}

/*!
 * brief Gets an default fault protection channel's configuration.
 *
 * The default effective values are:
 * code
 *   psConfig->sFaultInput[i].eFaultActiveLevel = kPWM_Logic0;
 *   psConfig->sFaultInput[i].bEnableAutoFaultClear = true;
 *   psConfig->sFaultInput[i].bEnableFaultFullCycleRecovery = true;
 * endcode
 * param psConfig  Pointer to fault protection configure structure. See @ref pwm_fault_protection_config_t.
 */
void PWM_GetFaultProtectionDefaultConfig(pwm_fault_protection_config_t *psConfig)
{
    assert(psConfig);

    /* Initializes the configure structure to zero. */
    (void)memset(psConfig, 0, sizeof(*psConfig));

    for (uint32_t i = 0; i < 4U; i++)
    {
        psConfig->sFaultInput[i].eFaultActiveLevel               = kPWM_Logic0;
        psConfig->sFaultInput[i].bEnableAutoFaultClear           = true;
        psConfig->sFaultInput[i].bEnableManualFaultClearSafeMode = false;
        psConfig->sFaultInput[i].bEnableFaultFullCycleRecovery   = true;
        psConfig->sFaultInput[i].bEnableFaultHalfCycleRecovery   = false;
        psConfig->sFaultInput[i].bEnableFaultNoCombinationalPath = true;
        psConfig->sFaultInput[i].bEnableFaultInterrupt           = false;
    }

    psConfig->bEnableFaultGlitchStretch = false;
    psConfig->bitsFaultFilterCount      = 0x0U;
    psConfig->u8FaultFilterPeriod       = 0x0U;
}

/*!
 * brief Sets up the PWM submodule configure.
 *
 * param base         PWM peripheral base address.
 * param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig     Pointer to submodule configure structure, see @ref pwm_sm_config_t.
 */
void PWM_SetupSMConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_config_t *psConfig)
{
    assert(psConfig);

    /* Disable the submodule counter first */
    PWM_DisableCounters(base, (uint16_t)1U << (uint16_t)eSubModule);
    PWM_ClearPwmLdok(base, (uint16_t)1U << (uint16_t)eSubModule);

    /* Only can be written one time after which it requires a reset to release the bit for writing again. */
    base->SM[eSubModule].CTRL =
        (base->SM[eSubModule].CTRL & ~(uint16_t)PWM_CTRL_COMPMODE_MASK) | PWM_CTRL_COMPMODE(psConfig->eValCompareMode);

    PWM_SetupCounterConfig(base, eSubModule, &psConfig->sCounterConfig);
    PWM_SetupReloadLogicConfig(base, eSubModule, &psConfig->sReloadConfig);
    PWM_SetupValRegisterConfig(base, eSubModule, &psConfig->sValRegisterConfig);
    PWM_SetupForceLogicConfig(base, eSubModule, &psConfig->sForceConfig);
#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
    PWM_SetupFractionalDelayConfig(base, eSubModule, &psConfig->sFracDelayConfig);
#endif
    PWM_SetupDeadtimeConfig(base, eSubModule, &psConfig->sDeadTimeConfig);
    PWM_SetupOutputConfig(base, eSubModule, &psConfig->sOutputConfig);
    PWM_SetupInputCaptureConfig(base, eSubModule, kPWM_InputCapturePwmX, &psConfig->sInCaptureConfig[0]);
    PWM_SetupInputCaptureConfig(base, eSubModule, kPWM_InputCapturePwmA, &psConfig->sInCaptureConfig[1]);
    PWM_SetupInputCaptureConfig(base, eSubModule, kPWM_InputCapturePwmB, &psConfig->sInCaptureConfig[2]);
    PWM_SetupSMFaultInputMapping(base, eSubModule, kPWM_PwmX, &psConfig->sPwmXFaultInputMapping);
    PWM_SetupSMFaultInputMapping(base, eSubModule, kPWM_PwmA, &psConfig->sPwmAFaultInputMapping);
    PWM_SetupSMFaultInputMapping(base, eSubModule, kPWM_PwmB, &psConfig->sPwmBFaultInputMapping);
    PWM_EnableSMInterrupts(base, eSubModule, psConfig->u16EnableInterruptMask);
    PWM_SetupDmaConfig(base, eSubModule, &psConfig->sDMAConfig);
    PWM_EnablePwmRunInDebug(base, eSubModule, psConfig->enableDebugMode);
    PWM_EnablePwmRunInWait(base, eSubModule, psConfig->enableWaitMode);

    /* Execute a software force initial when choose local software force signal */
    if (psConfig->sForceConfig.eForceSignalSelect == kPWM_LocalSoftwareForce)
    {
        PWM_SetSoftwareForce(base, eSubModule);
    }
    PWM_SetPwmLdok(base, (uint16_t)1U << (uint16_t)eSubModule);
}

/*!
 * brief Update PWM submodule compare value configuration according to the typical output mode.
 *
 * param psConfig             See @ref pwm_sm_config_t.
 * param eTypicalOutputMode   Typical PWM_A/B output mode. See @ref wm_sm_typical_output_mode_t.
 * param u16PwmPeriod         PWM output period value in counter ticks. This value can be
 *                            got by (main counter clock in Hz) / (wanted PWM signal frequency in Hz).
 * param u16PwmAPulseWidth    PWM_A pulse width value in counter ticks. Can got by (wanted PWM duty Cycle) *
 *                            u16PwmPeriod.
 * param u16PwmBPulseWidth    PWM_B pulse width value in counter ticks. Can got by (wanted PWM duty Cycle) *
 *                            u16PwmPeriod.
 */
void PWM_GetValueConfig(pwm_sm_value_register_config_t *psConfig,
                        pwm_sm_typical_output_mode_t eTypicalOutputMode,
                        uint16_t u16PwmPeriod,
                        uint16_t u16PwmAPulseWidth,
                        uint16_t u16PwmBPulseWidth)
{
    switch (eTypicalOutputMode)
    {
        case kPWM_SignedCenterAligned:
            /* Indicates the start of the PWM period */
            psConfig->u16CounterInitialValue = ~(u16PwmPeriod / 2U) + 1U;
            /* Indicates the center value */
            psConfig->u16ValRegister0 = 0x0U;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            psConfig->u16ValRegister1 = (u16PwmPeriod / 2U) - 1U;
            /* Indicates the turn on of the PWM_A */
            psConfig->u16ValRegister2 = ~(u16PwmAPulseWidth / 2U) + 1U;
            /* Indicates the turn off of the PWM_A */
            psConfig->u16ValRegister3 = (u16PwmAPulseWidth / 2U);
            /* Indicates the turn on of the PWM_B */
            psConfig->u16ValRegister4 = ~(u16PwmBPulseWidth / 2U) + 1U;
            /* Indicates the turn off of the PWM_B */
            psConfig->u16ValRegister5 = (u16PwmBPulseWidth / 2U);
            break;
        case kPWM_CenterAligned:
            /* Indicates the start of the PWM period */
            psConfig->u16CounterInitialValue = 0U;
            /* Indicates the center value */
            psConfig->u16ValRegister0 = (u16PwmPeriod / 2U);
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            psConfig->u16ValRegister1 = u16PwmPeriod - 1U;
            /* Indicates the turn on of the PWM_A */
            psConfig->u16ValRegister2 = ((u16PwmPeriod - u16PwmAPulseWidth) / 2U);
            /* Indicates the turn off of the PWM_A */
            psConfig->u16ValRegister3 = ((u16PwmPeriod + u16PwmAPulseWidth) / 2U);
            /* Indicates the turn on of the PWM_B */
            psConfig->u16ValRegister4 = ((u16PwmPeriod - u16PwmBPulseWidth) / 2U);
            /* Indicates the turn off of the PWM_B */
            psConfig->u16ValRegister5 = ((u16PwmPeriod + u16PwmBPulseWidth) / 2U);
            break;
        case kPWM_SignedEdgeAligned:
            /* Indicates the start of the PWM period */
            psConfig->u16CounterInitialValue = ~(u16PwmPeriod / 2U) + 1U;
            /* Indicates the center value */
            psConfig->u16ValRegister0 = 0x0U;
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            psConfig->u16ValRegister1 = (u16PwmPeriod / 2U) - 1U;
            /* Indicates the turn on of the PWM_A */
            psConfig->u16ValRegister2 = ~(u16PwmPeriod / 2U) + 1U;
            /* Indicates the turn off of the PWM_A */
            psConfig->u16ValRegister3 = ~(u16PwmPeriod / 2U) + u16PwmAPulseWidth + 1U;
            /* Indicates the turn on of the PWM_B */
            psConfig->u16ValRegister4 = ~(u16PwmPeriod / 2U) + 1U;
            /* Indicates the turn off of the PWM_B */
            psConfig->u16ValRegister5 = ~(u16PwmPeriod / 2U) + u16PwmBPulseWidth + 1U;
            break;
        case kPWM_EdgeAligned:
            /* Indicates the start of the PWM period */
            psConfig->u16CounterInitialValue = 0U;
            /* Indicates the center value */
            psConfig->u16ValRegister0 = (u16PwmPeriod / 2U);
            /* Indicates the end of the PWM period */
            /* The change during the end to start of the PWM period requires a count time */
            psConfig->u16ValRegister1 = u16PwmPeriod - 1U;
            /* Indicates the turn on of the PWM_A */
            psConfig->u16ValRegister2 = 0U;
            /* Indicates the turn off of the PWM_A */
            psConfig->u16ValRegister3 = u16PwmAPulseWidth;
            /* Indicates the turn on of the PWM_B */
            psConfig->u16ValRegister4 = 0U;
            /* Indicates the turn off of the PWM_B */
            psConfig->u16ValRegister5 = u16PwmBPulseWidth;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }
}

/*!
 * brief Sets up the PWM submodule deadtime logic configure.
 *
 * param base          PWM peripheral base address.
 * param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig      Pointer to deadtime logic configure structure, see @ref pwm_sm_deadtime_logic_config_t.
 */
void PWM_SetupDeadtimeConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_deadtime_logic_config_t *psConfig)
{
    switch (psConfig->eMode)
    {
        case kPWM_Independent:
            base->SM[eSubModule].CTRL2 |= PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL &= ~(uint16_t)PWM_CTRL_DBLEN_MASK;
            break;
        case kPWM_IndependentWithDoubleSwitchPwm:
            base->SM[eSubModule].CTRL2 |= PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL |= PWM_CTRL_DBLEN_MASK;
            break;
        case kPWM_IndependentWithSplitDoubleSwitchPwm:
            base->SM[eSubModule].CTRL2 |= PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL |= PWM_CTRL_DBLEN_MASK | PWM_CTRL_SPLIT_MASK;
            break;
        case kPWM_ComplementaryWithPwmA:
            base->SM[eSubModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL &= ~(uint16_t)PWM_CTRL_DBLEN_MASK;
            base->MCTRL &= ~(((uint16_t)1U << (uint16_t)eSubModule) << PWM_MCTRL_IPOL_SHIFT);
            break;
        case kPWM_ComplementaryWithPwmB:
            base->SM[eSubModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL &= ~(uint16_t)PWM_CTRL_DBLEN_MASK;
            base->MCTRL |= (((uint16_t)1U << (uint16_t)eSubModule) << PWM_MCTRL_IPOL_SHIFT);
            break;
        case kPWM_ComplementaryWithDoubleSwitchPwm:
            base->SM[eSubModule].CTRL2 &= ~(uint16_t)PWM_CTRL2_INDEP_MASK;
            base->SM[eSubModule].CTRL |= PWM_CTRL_DBLEN_MASK;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            assert(false);
            break;
    }

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
    /* The DTCNT0/1 field is interpreted differently depending on whether or not the fractional delays are enabled. */
    if ((((base->SM[eSubModule].FRCTRL & PWM_FRCTRL_FRAC23_EN_MASK) != 0U) &&
         (((base->MCTRL & PWM_MCTRL_IPOL(1U << (uint16_t)eSubModule)) == 0U))) ||
        (((base->SM[eSubModule].FRCTRL & PWM_FRCTRL_FRAC45_EN_MASK) != 0U) &&
         (((base->MCTRL & PWM_MCTRL_IPOL(1U << (uint16_t)eSubModule)) != 0U))))
    {
        base->SM[eSubModule].DTCNT0 =
            (psConfig->sDeadTimeValue0.bitsIntegerCycles << 5U) | psConfig->sDeadTimeValue0.bitsFractionalCycles;
        base->SM[eSubModule].DTCNT1 =
            (psConfig->sDeadTimeValue1.bitsIntegerCycles << 5U) | psConfig->sDeadTimeValue1.bitsFractionalCycles;
    }
    else
    {
        base->SM[eSubModule].DTCNT0 = psConfig->sDeadTimeValue0.bitsIntegerCycles;
        base->SM[eSubModule].DTCNT1 = psConfig->sDeadTimeValue1.bitsIntegerCycles;
    }
#else
    base->SM[eSubModule].DTCNT0 = psConfig->sDeadTimeValue0.bitsIntegerCycles;
    base->SM[eSubModule].DTCNT1 = psConfig->sDeadTimeValue1.bitsIntegerCycles;
#endif
}

#if (defined(FSL_FEATURE_PWM_HAS_FRACTIONAL) && FSL_FEATURE_PWM_HAS_FRACTIONAL)
/*!
 * brief Sets up the PWM submodule fractional delay logic configure.
 *
 * note The fractional delay logic can only be used when the IPBus clock is running at 100 MHz.
 *
 * param base         PWM peripheral base address.
 * param eSubModule   PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig     Pointer to fractional delay logic configure structure, see
 *                      @ref pwm_sm_fractional_delay_logic_config_t.
 */
void PWM_SetupFractionalDelayConfig(PWM_Type *base,
                                    pwm_sm_number_t eSubModule,
                                    const pwm_sm_fractional_delay_logic_config_t *psConfig)
{
    base->SM[eSubModule].FRACVAL1 = PWM_FRACVAL1_FRACVAL1(psConfig->bitsFracValue1);
    base->SM[eSubModule].FRACVAL2 = PWM_FRACVAL1_FRACVAL1(psConfig->bitsFracValue2);
    base->SM[eSubModule].FRACVAL3 = PWM_FRACVAL1_FRACVAL1(psConfig->bitsFracValue3);
    base->SM[eSubModule].FRACVAL4 = PWM_FRACVAL1_FRACVAL1(psConfig->bitsFracValue4);
    base->SM[eSubModule].FRACVAL5 = PWM_FRACVAL1_FRACVAL1(psConfig->bitsFracValue5);

    base->SM[eSubModule].FRCTRL =
        (uint16_t)(base->SM[eSubModule].FRCTRL &
                   ~(PWM_FRCTRL_FRAC45_EN_MASK | PWM_FRCTRL_FRAC23_EN_MASK | PWM_FRCTRL_FRAC1_EN_MASK)) |
        PWM_FRCTRL_FRAC45_EN(psConfig->bEnableVal45FractionalDelay) |
        PWM_FRCTRL_FRAC23_EN(psConfig->bEnableVal23FractionalDelay) |
        PWM_FRCTRL_FRAC1_EN(psConfig->bEnableVal1FractionalDelay);

    /* Power up fractional delay logic if anyone VAL fractional delay is enable */
    if (psConfig->bEnableVal45FractionalDelay || psConfig->bEnableVal23FractionalDelay ||
        psConfig->bEnableVal1FractionalDelay)
    {
        base->SM[eSubModule].FRCTRL |= PWM_FRCTRL_FRAC_PU_MASK;
        SDK_DelayAtLeastUs(25U, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    }
    else
    {
        base->SM[eSubModule].FRCTRL &= ~(uint16_t)PWM_FRCTRL_FRAC_PU_MASK;
    }
}
#endif

/*!
 * brief Sets up the PWM submodule output logic configure.
 *
 * param base          PWM peripheral base address.
 * param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig      Pointer to output logic configure structure, see @ref pwm_sm_output_logic_config_t.
 */
void PWM_SetupOutputConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_output_logic_config_t *psConfig)
{
    uint16_t u16RegOuten = base->OUTEN;
    uint16_t u16RegMask  = base->MASK;

    u16RegOuten &= ~(PWM_OUTEN_PWMX_EN((uint16_t)1U << (uint16_t)eSubModule) |
                     PWM_OUTEN_PWMB_EN((uint16_t)1U << (uint16_t)eSubModule) |
                     PWM_OUTEN_PWMA_EN((uint16_t)1U << (uint16_t)eSubModule));
    u16RegMask &=
        ~(PWM_MASK_MASKX((uint16_t)1U << (uint16_t)eSubModule) | PWM_MASK_MASKB((uint16_t)1U << (uint16_t)eSubModule) |
          PWM_MASK_MASKA((uint16_t)1U << (uint16_t)eSubModule));

    u16RegOuten |= PWM_OUTEN_PWMX_EN((uint16_t)(psConfig->bEnablePwmxOutput) << (uint16_t)eSubModule) |
                   PWM_OUTEN_PWMA_EN((uint16_t)(psConfig->bEnablePwmaOutput) << (uint16_t)eSubModule) |
                   PWM_OUTEN_PWMB_EN((uint16_t)(psConfig->bEnablePwmbOutput) << (uint16_t)eSubModule);
    u16RegMask |= PWM_MASK_MASKX((uint16_t)(psConfig->bMaskPwmxOutput) << (uint16_t)eSubModule) |
                  PWM_MASK_MASKA((uint16_t)(psConfig->bMaskPwmaOutput) << (uint16_t)eSubModule) |
                  PWM_MASK_MASKB((uint16_t)(psConfig->bMaskPwmbOutput) << (uint16_t)eSubModule);

