nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_pwm.c
    base->SM[eSubModule].OCTRL =
        PWM_OCTRL_POLA(psConfig->bInvertPwmaOutput) | PWM_OCTRL_POLB(psConfig->bInvertPwmbOutput) |
        PWM_OCTRL_POLX(psConfig->bInvertPwmxOutput) | PWM_OCTRL_PWMAFS(psConfig->ePwmaFaultState) |
        PWM_OCTRL_PWMBFS(psConfig->ePwmbFaultState) | PWM_OCTRL_PWMXFS(psConfig->ePwmxFaultState);
    base->SM[eSubModule].TCTRL = PWM_TCTRL_TRGFRQ(psConfig->bEnableTriggerPostScaler);
#if (defined(FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL) && FSL_FEATURE_PWM_HAS_MUX_TRIGGER_SOURCE_SEL)
    base->SM[eSubModule].TCTRL |= PWM_TCTRL_PWBOT1(psConfig->eMuxTrigger1) | PWM_TCTRL_PWAOT0(psConfig->eMuxTrigger0);
#endif
    base->SM[eSubModule].CTRL =
        (base->SM[eSubModule].CTRL & ~(uint16_t)(PWM_CTRL_DBLX_MASK)) | PWM_CTRL_DBLX(psConfig->ePwmXSignalSelect);

    base->OUTEN = u16RegOuten;
    /* Update output mask bits with force command */
    base->MASK = u16RegMask | PWM_MASK_UPDATE_MASK((uint16_t)1U << (uint16_t)eSubModule);
}

/*!
 * brief Sets up the PWM submodule input capture configure.
 *
 * Each PWM submodule has 3 pins that can be configured for use as input capture pins. This function
 * sets up the capture parameters for each pin and enables the input capture operation.
 *
 * param base          PWM peripheral base address.
 * param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * param eInputPin     PWM submodule input capture pin number, see @ref pwm_sm_input_capture_pin_t.
 * param psConfig      Pointer to input capture configure structure, see @ref pwm_sm_input_capture_config_t.
 */
void PWM_SetupInputCaptureConfig(PWM_Type *base,
                                 pwm_sm_number_t eSubModule,
                                 pwm_sm_input_capture_pin_t eInputPin,
                                 const pwm_sm_input_capture_config_t *psConfig)
{
    uint16_t u16Reg;
    if (eInputPin == kPWM_InputCapturePwmA)
    {
        u16Reg = PWM_CAPTCTRLA_CFAWM(psConfig->bitsCaptureFifoWatermark) |
                 PWM_CAPTCTRLA_INP_SELA(psConfig->eInCaptureSource) |
                 PWM_CAPTCTRLA_EDGA1(psConfig->eCircuit1CaptureEdge) |
                 PWM_CAPTCTRLA_EDGA0(psConfig->eCircuit0CaptureEdge) |
                 PWM_CAPTCTRLA_ONESHOTA(psConfig->bEnableOneShotCapture);
        if (psConfig->eInCaptureSource == kPWM_InputEdgeCounter)
        {
            u16Reg |= PWM_CAPTCTRLA_EDGCNTA_EN_MASK;
        }
        if (psConfig->bEnableInputCapture)
        {
            u16Reg |= PWM_CAPTCTRLA_ARMA_MASK;
            /* Disable PWM_A output when PWM_A pin is being used for input capture. */
            base->OUTEN &= ~PWM_OUTEN_PWMA_EN((uint16_t)1U << (uint16_t)eSubModule);
        }
        base->SM[eSubModule].CAPTCOMPA = psConfig->u8EdgeCounterCompareValue;
        base->SM[eSubModule].CAPTCTRLA = u16Reg;
    }
    else if (eInputPin == kPWM_InputCapturePwmB)
    {
        u16Reg = PWM_CAPTCTRLB_CFBWM(psConfig->bitsCaptureFifoWatermark) |
                 PWM_CAPTCTRLB_INP_SELB(psConfig->eInCaptureSource) |
                 PWM_CAPTCTRLB_EDGB1(psConfig->eCircuit1CaptureEdge) |
                 PWM_CAPTCTRLB_EDGB0(psConfig->eCircuit0CaptureEdge) |
                 PWM_CAPTCTRLB_ONESHOTB(psConfig->bEnableOneShotCapture);
        if (psConfig->eInCaptureSource == kPWM_InputEdgeCounter)
        {
            u16Reg |= PWM_CAPTCTRLB_EDGCNTB_EN_MASK;
        }
        if (psConfig->bEnableInputCapture)
        {
            u16Reg |= PWM_CAPTCTRLB_ARMB_MASK;
            /* Disable PWM_B output when PWM_B pin is being used for input capture. */
            base->OUTEN &= ~PWM_OUTEN_PWMB_EN((uint16_t)1U << (uint16_t)eSubModule);
        }
        base->SM[eSubModule].CAPTCOMPB = psConfig->u8EdgeCounterCompareValue;
        base->SM[eSubModule].CAPTCTRLB = u16Reg;
    }
    else
    {
        u16Reg = PWM_CAPTCTRLX_CFXWM(psConfig->bitsCaptureFifoWatermark) |
                 PWM_CAPTCTRLX_INP_SELX(psConfig->eInCaptureSource) |
                 PWM_CAPTCTRLX_EDGX1(psConfig->eCircuit1CaptureEdge) |
                 PWM_CAPTCTRLX_EDGX0(psConfig->eCircuit0CaptureEdge) |
                 PWM_CAPTCTRLX_ONESHOTX(psConfig->bEnableOneShotCapture);
        if (psConfig->eInCaptureSource == kPWM_InputEdgeCounter)
        {
            u16Reg |= PWM_CAPTCTRLX_EDGCNTX_EN_MASK;
        }
        if (psConfig->bEnableInputCapture)
        {
            u16Reg |= PWM_CAPTCTRLX_ARMX_MASK;
            /* Disable PWM_X output when PWM_X pin is being used for input capture. */
            base->OUTEN &= ~PWM_OUTEN_PWMX_EN((uint16_t)1U << (uint16_t)eSubModule);
        }
        base->SM[eSubModule].CAPTCOMPX = psConfig->u8EdgeCounterCompareValue;
        base->SM[eSubModule].CAPTCTRLX = u16Reg;
    }
}

/*!
 * brief Sets up the PWM fault protection channel configure.
 *
 * param base                PWM peripheral base address.
 * param eFaultProtection    PWM fault protection channel number, see @ref pwm_fault_protection_channel_t.
 * param psConfig            Pointer to fault protection channel configure structure, see @ref
 * pwm_fault_protection_config_t.
 */
void PWM_SetupFaultProtectionConfig(PWM_Type *base,
                                    pwm_fault_protection_channel_t eFaultProtection,
                                    const pwm_fault_protection_config_t *psConfig)
{
    uint16_t u16RegsFctrl = 0;
    uint16_t u16RegsFSTS  = 0;
    for (uint16_t i = 0; i < 4U; i++)
    {
        u16RegsFctrl |= PWM_FCTRL_FLVL((uint16_t)psConfig->sFaultInput[i].eFaultActiveLevel << i) |
                        PWM_FCTRL_FAUTO((uint16_t)psConfig->sFaultInput[i].bEnableAutoFaultClear << i) |
                        PWM_FCTRL_FSAFE((uint16_t)psConfig->sFaultInput[i].bEnableManualFaultClearSafeMode << i) |
                        PWM_FCTRL_FSAFE((uint16_t)psConfig->sFaultInput[i].bEnableFaultInterrupt << i);

        u16RegsFSTS |= PWM_FSTS_FHALF((uint16_t)psConfig->sFaultInput[i].bEnableFaultHalfCycleRecovery << i) |
                       PWM_FSTS_FFULL((uint16_t)psConfig->sFaultInput[i].bEnableFaultFullCycleRecovery << i);
    }

    base->FAULT[eFaultProtection].FCTRL = u16RegsFctrl;
    base->FAULT[eFaultProtection].FSTS  = u16RegsFSTS;
    base->FAULT[eFaultProtection].FCTRL2 =
        PWM_FCTRL2_NOCOMB(psConfig->sFaultInput[0].bEnableFaultNoCombinationalPath) |
        PWM_FCTRL2_NOCOMB((uint16_t)psConfig->sFaultInput[1].bEnableFaultNoCombinationalPath << (uint16_t)1U) |
        PWM_FCTRL2_NOCOMB((uint16_t)psConfig->sFaultInput[2].bEnableFaultNoCombinationalPath << (uint16_t)2U) |
        PWM_FCTRL2_NOCOMB((uint16_t)psConfig->sFaultInput[3].bEnableFaultNoCombinationalPath << (uint16_t)3U);

    base->FAULT[eFaultProtection].FFILT = PWM_FFILT_GSTR(psConfig->bEnableFaultGlitchStretch) |
                                          PWM_FFILT_GSTR(psConfig->bitsFaultFilterCount) |
                                          PWM_FFILT_GSTR(psConfig->u8FaultFilterPeriod);
}

/*!
 * brief Sets up the PWM submodule DMA configure.
 *
 * param base          PWM peripheral base address.
 * param eSubModule    PWM submodule number, see @ref pwm_sm_number_t.
 * param psConfig      Pointer to PWM submodule DMA configure, see @ref pwm_sm_dma_config_t.
 */
void PWM_SetupDmaConfig(PWM_Type *base, pwm_sm_number_t eSubModule, const pwm_sm_dma_config_t *psConfig)
{
    base->SM[eSubModule].DMAEN =
        PWM_DMAEN_VALDE(psConfig->bEnableWriteValDMA) | PWM_DMAEN_CA1DE(psConfig->bEnableReadCaptureA1DMA) |
        PWM_DMAEN_CA0DE(psConfig->bEnableReadCaptureA0DMA) | PWM_DMAEN_CB1DE(psConfig->bEnableReadCaptureB1DMA) |
        PWM_DMAEN_CB0DE(psConfig->bEnableReadCaptureB0DMA) | PWM_DMAEN_CX1DE(psConfig->bEnableReadCaptureX1DMA) |
        PWM_DMAEN_CX0DE(psConfig->bEnableReadCaptureX0DMA);

    if (psConfig->sCaptureDma.bEnableCaptureDMA)
    {
        PWM_SetEnabledCaptureDmaSource(base, eSubModule, psConfig->sCaptureDma.eCaptureDMASource);
    }
}
